<template>
  <div class="d-flex" style="height: 540px; width: 800px;">
    <div class="col" style="max-width: 343px;">
      <div class="row d-flex justify-content-center" style="overflow: auto; height: 540px; width: 356px;">
        <div class="btn btn-custom d-inline-flex align-items-center" @click="currTab=1">
          Фрактали
          <i class="fa fa-chevron-right right-arrow"></i>
        </div>
        <div class="btn btn-custom d-inline-flex align-items-center" @click="currTab=2">
          Мандельброт
          <i class="fa fa-chevron-right right-arrow"></i>
        </div>
        <div class="btn btn-custom d-inline-flex align-items-center" @click="currTab=3">
          Броунівський
          <i class="fa fa-chevron-right right-arrow"></i>
        </div>
        <div class="btn btn-custom d-inline-flex align-items-center" @click="currTab=4">
          Колірні схеми
          <i class="fa fa-chevron-right right-arrow"></i>
        </div>
        <div class="btn btn-custom d-inline-flex align-items-center" @click="currTab=5">
          RGB
          <i class="fa fa-chevron-right right-arrow"></i>
        </div>
        <div class="btn btn-custom d-inline-flex align-items-center" @click="currTab=6">
          HSV
          <i class="fa fa-chevron-right right-arrow"></i>
        </div>
        <div class="btn btn-custom d-inline-flex align-items-center" @click="currTab=7">
          Рухомі зображення
          <i class="fa fa-chevron-right right-arrow"></i>
        </div>
        <div class="btn btn-custom d-inline-flex align-items-center" @click="currTab=8" style="margin-bottom: 13px;">
          Афінні перетворення
          <i class="fa fa-chevron-right right-arrow"></i>
        </div>
      </div>
    </div>
    <div class="vr align-self-center" style="height: 100%; width: 3px; border: none; background-color: #bebebe;"></div>
    <div class="col align-self-center" style="overflow: auto; height: 540px;">
      <div v-if="currTab===1" style="padding: 13px; overflow: auto;">
        Фрактали - це геометричні об'єкти, які виявляють однакову структуру на будь-якому масштабі. Вони представляють собою складні форми, що повторюються на різних рівнях деталізації, що робить їх особливо цікавими та привабливими для вивчення.

Один з найвідоміших фракталів - це множина Мандельброта. Вона виникла в результаті ітеративного застосування простого математичного виразу до кожної точки на комплексній площині. Це створює красиві та складні геометричні структури, які можуть нагадувати різні форми при різних масштабах.

Фрактали знаходять застосування в різних галузях, таких як комп'ютерна графіка, математика, фізика, біологія та економіка. Вони можуть бути використані для моделювання природних явищ, таких як гірські хребти, хмари, або розвиток систем у реальному світі.

Фрактали також застосовуються в мистецтві. Багато художників використовують їх для створення абстрактних та захоплюючих композицій. Фрактальне мистецтво дозволяє об'єднати математичну точність і творчий елемент, створюючи унікальні та естетично привабливі твори.
      </div>
      <div v-if="currTab===2" style="padding: 13px; overflow: auto;">
        Множина Мандельброта - це один із найвідоміших та найцікавіших фракталів. Вона була відкрита та названа на честь математика Бенуа Мандельброта. Множина Мандельброта генерується за допомогою ітераційного процесу у комплексній площині.

Базовий вираз, який використовується для створення множини Мандельброта, виглядає так:

zn+1=zn2+czn+1=zn2+c

Тут zz та cc - комплексні числа. Множина Мандельброта складається з усіх комплексних чисел cc, для яких послідовність чисел znzn не обмежується за модулем при ітерації від n=0n=0 до нескінченності.

Завдяки цьому процесу виникає неймовірно складна та красива графічна репрезентація. На зображеннях множини Мандельброта видно безліч деталей та самоподібних структур, що повторюються на будь-якому масштабі.

Особливість множини Мандельброта полягає в тому, що вона є бар'єром між простими та складними системами. Тобто, навіть при високому рівні складності структур ми можемо виявити прості правила, що визначають, чи буде точка входити у множину.

Глибокий математичний зміст та естетична привабливість множини Мандельброта роблять її популярною як серед математиків та фізиків, так і серед художників та любителів фрактального мистецтва.
      </div>
      <div v-if="currTab===3" style="padding: 13px; overflow: auto;">
        Броунівський рух - це фізичний явище, вперше описане ботаніком Робертом Броуном у 1827 році, коли він вивчав рух частинок пилу в рідині. Це явище також відоме як рух Броуна або дифузія.

Броунівський рух виникає в результаті неперервного та випадкового зіткнення молекул рідини або газу з частинками, що рухаються. Навіть при відсутності зовнішніх сил на частинки, вони постійно випадково коливаються та переміщуються. Це явище є основою для розуміння ряду процесів, таких як дифузія та конвекція.

Одним з ключових висновків, які можна зробити з спостережень Броуна, є те, що його рух неможливо передбачити або контролювати через випадковий характер зіткнень молекул. Це важливо в контексті статистичної механіки та термодинаміки.

У сучасному вимірювальному обладнанні Броунівський рух може бути використаний для визначення розмірів частинок, їхнього заряду та інших характеристик. Феномен також знаходить застосування в наукових дослідженнях, включаючи біологію, де він може використовуватися для вивчення руху мікроорганізмів чи молекул в біологічних системах.
      </div>
      <div v-if="currTab===4" style="padding: 13px; overflow: auto;">
        Кольорові моделі в комп'ютерній графіці є системами представлення кольорів за допомогою числових значень. Ці моделі допомагають визначати кольори, використовуючи різні комбінації основних кольорів. Ось кілька найпоширеніших комп'ютерних моделей кольорів:

RGB (Red, Green, Blue): Ця модель базується на комбінації трьох основних кольорів - червоного, зеленого та синього. Кожен піксель у зображенні описується трьома числовими значеннями, що представляють яскравість кожного кольору.

CMYK (Cyan, Magenta, Yellow, Key/Black): Використовується у друкарстві та виробництві. Кожен колір представлений від'ємними відтінками основних кольорів - синього, червоного та жовтого, а також чорного для додавання глибини та деталей.

HSV (Hue, Saturation, Value): В цій моделі кожен колір визначається трема параметрами - відтінок, насиченість та значення (яскравість). Вона особливо корисна для роботи зі зміною відтінку та насиченості.

Lab (CIE 1976 Lab):* Ця модель представляє кольори у тривимірному просторі, використовуючи параметри світлоти (L*), зеленого-червоного (a*) та синього-жовтого (b*). Вона більш природно відображає сприйняття кольорів людиною.

Кожна з цих моделей має свої переваги та використовується в різних галузях, залежно від конкретних потреб. Розуміння цих моделей є важливим для дизайнерів, розробників графіки та фахівців у сферах обробки зображень та друкарства.        
      </div>
      <div v-if="currTab===5" style="padding: 13px; overflow: auto;">
        RGB (Red, Green, Blue) - це аддитивна кольорова модель, яка використовує комбінацію червоного, зеленого та синього кольорів для створення широкого спектру кольорів. У цій моделі кожен колір визначається відсотком або значенням від 0 до 255 для кожного з трьох основних кольорів.

Основні риси RGB:

    Додавання кольорів: Колір у системі RGB створюється додаванням різних часток світла червоного, зеленого та синього кольорів. Наприклад, повний обсяг кожного з цих трьох кольорів утворює білий колір.

    24-бітна глибина кольору: У більшості комп'ютерних систем кожен кольоровий піксель зображення визначається 8 бітами для кожного з трьох основних кольорів (червоного, зеленого, синього), що усього дає 24 біти. Це дозволяє представляти близько 16,8 мільйонів різних кольорів.

    Застосування в моніторах та дисплеях: Більшість моніторів, телевізорів та інших відображувальних пристроїв використовують технологію RGB. Кожен піксель на екрані складається з трьох світлових точок для червоного, зеленого та синього, які взаємодіють, щоб створити барви.

    Колірні простори: RGB використовує різні колірні простори, такі як sRGB або Adobe RGB, які визначають конкретні стандарти для представлення кольорів. Це важливо для забезпечення співвідношення кольорів між різними пристроями та додатками.

У комп'ютерній графіці та дизайні, роботі з фотографіями та відео, роботі з веб-дизайном і багатьох інших сферах RGB є основною та широко використовуваною кольоровою моделлю.
      </div>
      <div v-if="currTab===6" style="padding: 13px; overflow: auto;">
        Модель кольорів HSV (Hue, Saturation, Value) - це інша система представлення кольорів, яка відрізняється від RGB інтерпретацією кольору як комбінації відтінку, насиченості та значення (яскравості). Основні компоненти цієї моделі визначаються наступним чином:

    Відтінок (Hue): Визначає, який кольор або тон представлений. Відтінок вимірюється в градусах колірного кола, де 0° відповідає червоному, 120° - зеленому, а 240° - синьому. Значення може варіюватися від 0° до 360°.

    Насиченість (Saturation): Визначає чистоту або яскравість кольору. Зменшення насиченості призводить до відтінків сірого. Значення насиченості вимірюється відсотками, де 0% відповідає відтінкам сірого, а 100% - максимально насиченим кольорам.

    Значення (Value): Визначає яскравість кольору. Значення 0 вказує на чорний колір, а 100 - на повністю насичений кольор.

Основні переваги HSV:

    Інтуїтивне представлення кольору: HSV набагато більше відповідає сприйняттю кольору людиною і робить зміну кольору більш інтуїтивною, особливо при роботі з графічними програмами.

    Легше змінювати відтінок та насиченість: Перетворення відтінку та насиченості у моделі HSV зазвичай є простішими, ніж у RGB, що робить цю модель популярною в дизайні та обробці фотографій.

Хоча HSV не так часто використовується у відображенні графіки, як RGB, вона є корисною для визначення кольорів у більш інтуїтивному та зрозумілому способі.
      </div>
      <div v-if="currTab===7" style="padding: 13px; overflow: auto;">
        Математичні основи синтезу рухомих зображень включають в себе використання різних геометричних та математичних концепцій для моделювання та відтворення об'єктів у тривимірному просторі. Однією з ключових математичних тем у синтезі рухомих зображень є афінні перетворення та базові перетворення координат та об'єкту.
Афінні перетворення:

Афінні перетворення - це клас перетворень, які зберігають паралельність ліній, а також відстані та кути між точками. Вони включають такі операції, як трансляція (переміщення), поворот, масштабування та зеркальне відображення.

    Трансляція (переміщення): Зміщення об'єкту на площині на певну відстань у напрямку x та y.

    Поворот: Обертання об'єкта навколо заданої точки або вісі.

    Масштабування: Зміна розміру об'єкта шляхом збільшення або зменшення вздовж обох або одного з координатних напрямків.

    Зеркальне відображення: Віддзеркалення об'єкта вздовж визначеного напряму.

Базові перетворення координат та об'єкту:

    Трансляція координат: Переміщення всіх точок об'єкта на певну відстань у напрямку x, y та/або z.

    Поворот координат: Обертання точок об'єкта навколо координатного початку або іншої точки.

    Масштабування координат: Збільшення або зменшення розмірів об'єкта, розташованого вздовж координатних напрямів.

    Матричні перетворення: Використання матриць для представлення афінних перетворень та їх ефективного застосування до координат об'єктів.

Ці математичні концепції і перетворення є основними для реалістичного моделювання та синтезу рухомих зображень в комп'ютерній графіці та відтворенні тривимірних об'єктів на екрані. Вони використовуються у програмах для створення відмінних візуальних ефектів, анімації та ігор.
      </div>
      <div v-if="currTab===8" style="padding: 13px; overflow: auto;">
        Афінні перетворення — це клас геометричних перетворень в евклідному просторі, які зберігають прямі лінії та паралельність. Ці перетворення важливі в комп'ютерній графіці, обробці зображень та комп'ютерному зорі, оскільки вони дозволяють змінювати розміри, положення та орієнтацію об'єктів.

Основні афінні перетворення включають:

    Трансляція (зсув): Переміщення об'єкта на певну відстань уздовж вісей координат. Трансляція може бути вздовж одного або декількох напрямків.

    Поворот: Обертання об'єкта навколо заданої точки або центра координат. Поворот може бути виконаний навколо будь-якої вісі.

    Масштабування: Збільшення або зменшення розмірів об'єкта. Масштабування може бути однорідним (однаковим за всіма напрямками) або нелінійним.

    Зеркальне відображення: Створення відображення об'єкта вздовж визначеної площини. Наприклад, зеркальне відображення вздовж площини xy відображає об'єкт вздовж вісі z.

Ці операції можуть бути виражені матрицями, що дозволяє легко і ефективно використовувати їх у комп'ютерних програмах для реалізації афінних перетворень. Матриці афінних перетворень множаться на координати точок об'єкта для отримання нових координат після застосування перетворень.

Афінні перетворення використовуються в широкому спектрі областей, таких як комп'ютерна графіка, обробка зображень, віртуальна реальність, комп'ютерне зорове сприйняття та інші, де потрібно взаємодія з тривимірними об'єктами.
      </div>
    </div>
  </div>
</template>

<script>  
export default {
  name: 'MaterialsA',
  data() {
    return {
      currTab: 0,
    };
  },
  mounted() {
    this.$emit('help', 'materials');
  },
  methods: {
    
  },
  watch: {
    
  },
};
</script>

<style scoped>
.btn-playpause {
  width: 60px;
  height: 45px;
  background-color: #ebebeb;
  border: 3px solid #ebebeb;
  border-radius: 12px;
  font-size: 28px;
  margin-top: 13px;
}
.right-arrow {
  color: #bebebe;
  font-size: 32px;
  margin-left: auto;
}
.btn-custom {
  font-size: 22px;
  margin-top: 13px;
  border-radius: 24px;
  height: 56px;
  width: 306px;
  background-color: #ebebeb; 
  border: 3px solid #ebebeb;
}
.btn:active {
  border: 3px solid #bebebe;
  background-color: #ebebeb;
}
.btn-custom-i {
  font-size: 22px;
  margin-bottom: 13px;
  border-radius: 24px;
  height: 56px;
  width: 306px;
  background-color: #bebebe; 
  background-image: linear-gradient(to right, #ebebeb 85%, rgba(0,0,0,0) 20%); 
  border: 3px solid #ebebeb;
}
.btn-i:active {
  border: 3px solid #bebebe;
  background-color: #bebebe;
  background-image: linear-gradient(to right, #ebebeb 85%, rgba(0,0,0,0) 20%); 
}
</style>
